rotten_mangoes/app/controllers/movies_controller.rb

      def index
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"

      def show
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

      def edit
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

      def create
        @movie = Movie.new(movie_params)

        if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

      def update
        @movie = Movie.find(params[:id])

        if @movie.update_attributes(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "poster_image_url" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["poster_image_url", "godfather.com"], ["updated_at", Tue, 26 Apr 2016 21:49:09 UTC +00:00]]

      def destroy
        @movie = Movie.find(params[:id])
        @movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]