rotten_mangoes/app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
---
  def new
    @movie = Movie.find(params[:movie_id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 29 Apr 2016 18:21:33 UTC +00:00], ["movie_id", 1], ["rating_out_of_ten", 9], ["text", "So good."], ["updated_at", Fri, 29 Apr 2016 18:21:33 UTC +00:00], ["user_id", 1]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.build(review_params)
    @review.user_id = @current_user.id
      if @review.save